snlkuharlocal/src/DataProcessors/ПакетнаяПечать/ПакетнаяПечать.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ПакетнаяПечать</name>
  <attributes>
    <name>ТекДок</name>
    <type>
      <types>DocumentRef.ПриходнаяНакладная</types>
      <types>DocumentRef.РекламационнаяНакладная</types>
      <types>DocumentRef.РасходнаяНакладная</types>
      <types>DocumentRef.Перемещение</types>
    </type>
  </attributes>
  <attributes>
    <name>НаборФорм</name>
    <type>
      <types>CatalogRef.НаборыПечатныхФорм</types>
    </type>
  </attributes>
  <attributes>
    <name>СразуНаПринтер</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗакрытьПослеПечати</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяПринтера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Сохранять</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КаталогСохраненияВыходныхФорм</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Просмотр</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоДопЭкземпляров</name>
    <comment>Количество дополнительно печатаемых экземпляров документов</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФорматСохранения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственноеЛицоПриПечатиДокументов</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекДокРКМ</name>
    <type>
      <types>DocumentRef.РекламационнаяНакладная</types>
    </type>
  </attributes>
</mdclass:DataProcessor>

snlkuharlocal/src/Enums/ВидыОплаты/ВидыОплаты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОплаты</name>
  <enumValues>
    <name>НАЛ</name>
    <comment>Наличные</comment>
  </enumValues>
  <enumValues>
    <name>БН</name>
    <comment>Без нал</comment>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Enums/ТипыДоставки/ТипыДоставки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыДоставки</name>
  <enumValues>
    <name>Доставка</name>
  </enumValues>
  <enumValues>
    <name>ТранспортнаяКомпания</name>
  </enumValues>
  <enumValues>
    <name>Самовывоз</name>
  </enumValues>
  <enumValues>
    <name>Перегруз</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Enums/СостояниеДокументов/СостояниеДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостояниеДокументов</name>
  <enumValues>
    <name>НеВыписаны</name>
  </enumValues>
  <enumValues>
    <name>Выписаны</name>
  </enumValues>
  <enumValues>
    <name>ВыписаныПовторно</name>
  </enumValues>
  <enumValues>
    <name>Получены</name>
  </enumValues>
  <enumValues>
    <name>ПолученыСИзменениями</name>
  </enumValues>
  <enumValues>
    <name>ПодтвержденаСумма</name>
  </enumValues>
  <enumValues>
    <name>ПодтвержденаСуммаСИзменениями</name>
  </enumValues>
  <enumValues>
    <name>ОшибкиОформления</name>
  </enumValues>
  <enumValues>
    <name>ПолученоИзображение</name>
  </enumValues>
  <enumValues>
    <name>СканСОшибками</name>
  </enumValues>
  <enumValues>
    <name>Проверены</name>
  </enumValues>
  <enumValues>
    <name>ГотовыКОтправкеВОФис</name>
    <comment>готов к отправке в офис из удаленного подразделения</comment>
  </enumValues>
  <enumValues>
    <name>ПолученДокументЗаместитель</name>
  </enumValues>
  <enumValues>
    <name>НаСкладе</name>
    <comment>Документ с изменениями, сданный на склад для создания рекламации</comment>
  </enumValues>
  <enumValues>
    <name>ОтправленВОфис</name>
    <comment>Оригинал отправлен в офис по письменному запросу</comment>
  </enumValues>
  <enumValues>
    <name>ВозвращенВАрхив</name>
  </enumValues>
  <enumValues>
    <name>ОтправленВПРО</name>
  </enumValues>
  <enumValues>
    <name>ВнесеныИзменения</name>
  </enumValues>
  <enumValues>
    <name>ПолученыВФилиале</name>
  </enumValues>
  <enumValues>
    <name>ОтсутствуютВосстановитьНеВозможно</name>
  </enumValues>
  <enumValues>
    <name>ПоДоверенности</name>
  </enumValues>
  <enumValues>
    <name>ПодписанВЭДО</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Catalogs/НаборыПечатныхФорм/НаборыПечатныхФорм.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>НаборыПечатныхФорм</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>Стандарт</name>
      <description>Стандартный набор</description>
    </items>
  </predefined>
  <tabularSections>
    <name>Список</name>
    <attributes>
      <name>ИмяФайла</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоЭкземпляров</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВыходнаяФорма</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Кратко</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПечататьШтрихКоды</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидШтрихКода</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипАртикула</name>
      <type>
        <types>CatalogRef.ТипыАтрикуловКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>БелаяСФ</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидКонтрагента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИсточникОрганизации</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ПечатататьИсходныйНомер</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПечататьНомерЗаказа</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПечататьДатуЗаказа</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ИмяФайлаВнешнегоШаблона</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ПечататьПолныеРеквизитыБанка</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПечататьПочтовыйАдресвСФ</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПечататьПокупателяВОсновании</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПечататьИННвАдресе</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НеПечататьШтрихКодДокумента</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПечататьКодПоставщика</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НеВыписыватьСФНаСкладе</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СводныеСФ</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПечататьЮрАдресВместоПочтового</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ДопПараметры</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ИндивидуальнаяНастройкаПодКонтрагента</name>
      <type>
        <types>CatalogRef.НастройкиПечатиПодКонтрагента</types>
      </type>
    </attributes>
    <attributes>
      <name>НестандартноеКоличествоДокументов</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>УпорядочитьНоменклатуру</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПечататьДатуОплаты</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ВыводитьАвтомобиль</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>РазбиватьНДСна10и18</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>КратностьИзМатрицы</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПечататьКолПаллет</name>
      <comment>Добавляет строки с товаром Паллет и кол-вом при печати </comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НеПечатать</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Параметры</name>
    <attributes>
      <name>ВыходнаяФорма</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Параметр</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ПараметрыПечатиДокументов</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ПараметрыПечатиДокументов</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

snlkuharlocal/src/DataProcessors/ПакетнаяПечать/ObjectModule.bsl
Функция УстановитьОрганизацию(СтрокаТЧ)
	Если СтрокаТЧ.ИсточникОрганизации="Склад" Тогда
		Организация=ТекДок.Склад.Организация;
	ИначеЕсли СтрокаТЧ.ИсточникОрганизации="Документ" Тогда			
		Организация=ТекДок.Организация;					
	КонецЕсли; 
	Если Организация.Пустая() Тогда
		Организация=ПолучитьЗначениеПоУмолчанию("ОсновнаяОрганизация");	
	КонецЕсли;
КонецФункции // УстановитьОрганизацию()
 

Процедура ПечатьПакета(ПечататьСФ, ПечататьТорг12, ПечатьСпец, Исправление, КоррСФ=Ложь,НеУчитыватьРекламации=Ложь ) Экспорт	
	ИмяПринтера=ПолучитьЗначениеПоУмолчанию("ОсновнойПринтер");	
	
	ДопПараметы=Новый Структура;
	ДопПараметы.Вставить("НаборПечатныхФорм",НаборФорм);
	ДопПараметы.Вставить("ПакетнаяПечать",Истина);
	
	//крохин начало 17.01.2020
	//для РНК "а" используется другой набор печатных форм
	Если  ТекДок.Метаданные().Имя = "РасходнаяНакладная" и ТекДок.ВидОплаты = Перечисления.ВидыОплаты.НАЛ Тогда
	НаборФорм = Справочники.НаборыПечатныхФорм.НайтиПоКоду("SNL-00223");
	КонецЕсли;
	//крохин конец 17.01.2020
		
	Для Каждого СтрокаТЧ Из НаборФорм.Список Цикл
		//Катаев+ 08/10/13 Проверка на печать нужной формы
		Если СтрокаТЧ.ВыходнаяФорма="СФ" И ПечататьСФ = Ложь Тогда
			Продолжить;
		КонецЕсли;
		Если СтрокаТЧ.ВыходнаяФорма="Торг12" И ПечататьТорг12 = Ложь Тогда
			Продолжить;
		КонецЕсли;
		Если СтрокаТЧ.ВыходнаяФорма="Спец." И ПечатьСпец = Ложь Тогда
			Продолжить;
		КонецЕсли;
		
		////нечаева 01,07,15+++ для заявки на тсд
		//Если (ИмяВыходнойФормы=Неопределено или ИмяВыходнойФормы="СФ" ) и  КоррСФ=Истина Тогда
		//	ИмяВыходнойФормы="КоррСФ";
		//КонецЕсли;
		//нечаева 01,07,15---
			
				
		//Катаев- 08/10/13
		//крохин начало 01.03.2012
		//Для контрагентов ЕЕЭ без претензий печатаем документы исходя из способа доставки
		//КоличествоЭкземпляров=СтрокаТЧ.КоличествоЭкземпляров+КоличествоДопЭкземпляров;
		СтандартноеКоличествоЭкземпляровДляПечати = 0;
		Если ТекДок.Метаданные().имя = "РасходнаяНакладная" И ТекДок.Контрагент.ТранспортныйОтдел = Справочники.Контрагенты.НайтиПоКоду("SSR-1610") Тогда
			
			//Кухарь 04.05.18 начало
			//Тип доставки теперь есть в документе
			//Если ТекДок.ПунктДоставки.ТипДоставки = Перечисления.ТипыДоставки.ТранспортнаяКомпания Тогда		
			попытка
				если ЗначениеЗаполнено(ТекДок.ТипДоставки) тогда
					ТипДоставки=ТекДок.ТипДоставки;
				иначе
					ТипДоставки=ТекДок.ПунктДоставки.ТипДоставки;
				КонецЕсли;
			Исключение
				ТипДоставки=ТекДок.ПунктДоставки.ТипДоставки;
			КонецПопытки;
			Если ТипДоставки = Перечисления.ТипыДоставки.ТранспортнаяКомпания Тогда
				//Кухарь 04.05.18 конец			
							Если СтрокаТЧ.ВыходнаяФорма="Торг12" Тогда
					//Кухарь 15.06.16 начало
					//СтандартноеКоличествоЭкземпляровДляПечати=3;
					если ТекДок.ПунктДоставки.ТраспортнаяКомпания=Справочники.Контрагенты.НайтиПоКоду("SSP-6122") тогда
						СтандартноеКоличествоЭкземпляровДляПечати=2;
					иначе
						//крохин начало 18.01.2019
						//для ПЭК и деловых линий 2 экземпляра, кроме ДСП
						//СтандартноеКоличествоЭкземпляровДляПечати=3;
						//Кухарь 19.02.19 начало
						//Если ТекДок.ТраспортнаяКомпания = Справочники.Контрагенты.НайтиПоКоду("SSP-6039") ИЛИ ТекДок.ТраспортнаяКомпания = Справочники.Контрагенты.НайтиПоКоду("SSP-6924") Тогда
						//Если ТекДок.ТранспортнаяКомпания = Справочники.Контрагенты.НайтиПоКоду("SSP-6039") ИЛИ ТекДок.ТранспортнаяКомпания = Справочники.Контрагенты.НайтиПоКоду("SSP-6924") Тогда  
						
					// Кухарь А.Ю.  29.11.2022 начало
					// 
						//Если ТекДок.ТранспортнаяКомпания = Справочники.Контрагенты.НайтиПоКоду("SSP-6039") ИЛИ ТекДок.ТранспортнаяКомпания = Справочники.Контрагенты.НайтиПоКоду("SSP-6924") Тогда		
						если ПрочитатьРСРеквизитСправочника(ТекДок.ТранспортнаяКомпания,"2Экземпляра",Ложь) = ложь тогда 					 
					// Кухарь А.Ю.  29.11.2022 конец
					

	
							
							
							
							
						//Кухарь 19.02.19 конец
	
						СтандартноеКоличествоЭкземпляровДляПечати=2;
						    Иначе
						СтандартноеКоличествоЭкземпляровДляПечати=3;
					    КонецЕсли;
					    //крохин конец 18.01.2019
					КонецЕсли;
					//Кухарь 15.06.16 конец

		                                                  //нечаева 19,06,17+++
				ИначеЕсли СтрокаТЧ.ВыходнаяФорма="СФ" или СтрокаТЧ.ВыходнаяФорма="УПД" Тогда		
					//Кухарь 15.06.16 начало               //нечаева 19,06,17--
					//СтандартноеКоличествоЭкземпляровДляПечати=3;
					если ТекДок.ПунктДоставки.ТраспортнаяКомпания=Справочники.Контрагенты.НайтиПоКоду("SSP-6122") тогда
						СтандартноеКоличествоЭкземпляровДляПечати=2;
					иначе
						//крохин начало 18.01.2019
						//для ПЭК и деловых линий 2 экземпляра, кроме ДСП
						//СтандартноеКоличествоЭкземпляровДляПечати=3;
						//Кухарь 19.02.19 начало
						//Если ТекДок.ТраспортнаяКомпания = Справочники.Контрагенты.НайтиПоКоду("SSP-6039") ИЛИ ТекДок.ТраспортнаяКомпания = Справочники.Контрагенты.НайтиПоКоду("SSP-6924") Тогда
						// Кухарь А.Ю.  29.11.2022 начало
						// 
						//Если ТекДок.ТранспортнаяКомпания = Справочники.Контрагенты.НайтиПоКоду("SSP-6039") ИЛИ ТекДок.ТранспортнаяКомпания = Справочники.Контрагенты.НайтиПоКоду("SSP-6924") Тогда		
						если ПрочитатьРСРеквизитСправочника(ТекДок.ТранспортнаяКомпания,"2Экземпляра",Ложь) = ложь тогда 					 
							// Кухарь А.Ю.  29.11.2022 конец
							

	
							
						//Кухарь 19.02.19 конец
		
						СтандартноеКоличествоЭкземпляровДляПечати=2;
						    Иначе
						СтандартноеКоличествоЭкземпляровДляПечати=3;
					    КонецЕсли;
					    //крохин конец 18.01.2019
					КонецЕсли;
					//Кухарь 15.06.16 конец

						
					
	
			//	ИначеЕсли СтрокаТЧ.ВыходнаяФорма="ТТН" тогда
			//		СтрокаТЧ.КоличествоЭкземпляров=3;
				ИначеЕсли СтрокаТЧ.ВыходнаяФорма="Спец." тогда
					СтандартноеКоличествоЭкземпляровДляПечати=1; 
				КонецЕсли;	
				//Кухарь 04.05.18 начало
				//Тип доставки теперь есть в документе
				//ИначеЕсли ТекДок.ПунктДоставки.ТипДоставки = Перечисления.ТипыДоставки.Доставка Тогда
			ИначеЕсли ТипДоставки = Перечисления.ТипыДоставки.Доставка Тогда
				//Кухарь 04.05.18 конец	
				Если СтрокаТЧ.ВыходнаяФорма="Торг12" Тогда
					СтандартноеКоличествоЭкземпляровДляПечати=2;			
					 									//нечаева 19,06,17+++
				ИначеЕсли СтрокаТЧ.ВыходнаяФорма="СФ" или СтрокаТЧ.ВыходнаяФорма="УПД" Тогда		
														//нечаева 19,06,17----
					СтандартноеКоличествоЭкземпляровДляПечати=2;	
			//	ИначеЕсли СтрокаТЧ.ВыходнаяФорма="ТТН" тогда
			//		СтрокаТЧ.КоличествоЭкземпляров=3;
				ИначеЕсли СтрокаТЧ.ВыходнаяФорма="Спец." тогда
					СтандартноеКоличествоЭкземпляровДляПечати=1; 
				КонецЕсли;	
				//Кухарь 04.05.18 начало
				//Тип доставки теперь есть в документе
				//ИначеЕсли ТекДок.ПунктДоставки.ТипДоставки = Перечисления.ТипыДоставки.Самовывоз Тогда
			ИначеЕсли ТипДоставки = Перечисления.ТипыДоставки.Самовывоз Тогда
				//Кухарь 04.05.18 конец	

					Если СтрокаТЧ.ВыходнаяФорма="Торг12" Тогда
					СтандартноеКоличествоЭкземпляровДляПечати=2;			
					//нечаева 19,06,17+++
				ИначеЕсли СтрокаТЧ.ВыходнаяФорма="СФ" или СтрокаТЧ.ВыходнаяФорма="УПД" Тогда		
					//нечаева 19,06,17----
					СтандартноеКоличествоЭкземпляровДляПечати=2;	
			//	ИначеЕсли СтрокаТЧ.ВыходнаяФорма="ТТН" тогда
			//		СтрокаТЧ.КоличествоЭкземпляров=3;
				ИначеЕсли СтрокаТЧ.ВыходнаяФорма="Спец." тогда
					СтандартноеКоличествоЭкземпляровДляПечати=1; 
				КонецЕсли;	

			КонецЕсли;
		//+++Лобан 130912	
		ИначеЕсли ТекДок.Метаданные().имя = "Перемещение" тогда
			Если СтрокаТЧ.ВыходнаяФорма="Торг13" Тогда
					СтандартноеКоличествоЭкземпляровДляПечати=2
				КонецЕсли;
		//---Лобан 130912			
		КонецЕсли;
		//крохин конец 01.03.2012
		
		
		//кухарь 18.07.14 начало
		Если СтрокаТЧ.ВыходнаяФорма="Реестр" тогда
			//Кухарь 12.10.15 начало
			//По просьбе Лисицкого всегда 1 реестр
			//Если ТекДок.ПунктДоставки.ТипДоставки = Перечисления.ТипыДоставки.ТранспортнаяКомпания Тогда
			//	
			//	СтандартноеКоличествоЭкземпляровДляПечати=2; 
			//Иначе
				СтандартноеКоличествоЭкземпляровДляПечати=1;
			//КонецЕсли;
			//Кухарь 12.10.15 конец
		КонецЕсли;
		//кухарь 18.07.14 конец
		
		//Кухарь 07.07.16 начало
		//По согласованию с кудряшовым
		если СтандартноеКоличествоЭкземпляровДляПечати > 1 и (СтрокаТЧ.ВыходнаяФорма="СФ"  или СтрокаТЧ.ВыходнаяФорма="УПД") тогда
			СтандартноеКоличествоЭкземпляровДляПечати=СтандартноеКоличествоЭкземпляровДляПечати-1;
		КонецЕсли;
		//Кухарь 07.07.16 конец

		
		//крохин начало 17.05.2012
		Если СтрокаТЧ.НестандартноеКоличествоДокументов Тогда
		СтандартноеКоличествоЭкземпляровДляПечати = СтрокаТЧ.КоличествоЭкземпляров;	
		КонецЕсли;
		//крохин конец 17.05.2012
		
		Если СтандартноеКоличествоЭкземпляровДляПечати <> 0 Тогда
			КоличествоЭкземпляров = СтандартноеКоличествоЭкземпляровДляПечати+КоличествоДопЭкземпляров;
		Иначе
			КоличествоЭкземпляров=СтрокаТЧ.КоличествоЭкземпляров+КоличествоДопЭкземпляров;
			
			//Кухарь 07.07.16 начало
			//Тут тоже уменьшим на 1 экземпляр для СФ
			
			//нечаева 19,06,17+++ - упд добавила везде где СФ
			если  (СтрокаТЧ.ВыходнаяФорма="СФ" или СтрокаТЧ.ВыходнаяФорма="УПД") и КоличествоЭкземпляров>1  тогда
				КоличествоЭкземпляров=КоличествоЭкземпляров-1;
			КонецЕсли;
			//Кухарь 07.07.16 конец

		КонецЕсли;
		//крохин начало 05.06.2012
		//для документов без цен печатаем только ТОРГ-12
		//+++Лобан 130912	
		//Старый код
		//Если ТекДок.Товары.Итог("Всего") = 0 И СтрокаТЧ.ВыходнаяФорма <> "Торг12" Тогда
		//	КоличествоЭкземпляров = 0;
		//КонецЕсли;
		//Новый код
		//крохин начало 20.01.2020
		//ТТН тоже надо выводить
		//Если ТекДок.Товары.Итог("Всего") = 0 И СтрокаТЧ.ВыходнаяФорма <> "Торг12" И СтрокаТЧ.ВыходнаяФорма <> "Торг13" Тогда
		Если ТекДок.Товары.Итог("Всего") = 0 И СтрокаТЧ.ВыходнаяФорма <> "Торг12" И СтрокаТЧ.ВыходнаяФорма <> "Торг13" И СтрокаТЧ.ВыходнаяФорма <> "ТТН" Тогда
		//крохин конец 20.01.2020	
		    КоличествоЭкземпляров = 0;
		КонецЕсли;
		//---Лобан 130912
		//крохин конец 05.06.2012
		
		
		//нечаева 06,07,17++
		Если СтрокаТЧ.ВыходнаяФорма="УПД" Тогда
			КоличествоЭкземпляров=3;
		КонецЕсли;	
		//нечаева 06,07,17++

		
		
		Если КоличествоЭкземпляров=0 Тогда Продолжить КонецЕсли;
			
		
		УстановитьОрганизацию(СтрокаТЧ);
				
		ДопПараметы.Вставить("ВыходнаяФорма",СтрокаТЧ);
				
		ОбработкаПечатиОбъект	= ПолучитьВнешнююОбработку(СтрокаТЧ.ИмяФайла,"PrnForms\");		
		Если ОбработкаПечатиОбъект=Неопределено Тогда Возврат КонецЕсли; 
		
		ОбработкаПечати=ОбработкаПечатиОбъект.ПолучитьФорму();
		//Катаев+ 31/03/14 Для СФ передаем параметр "Исправление"
		Если СтрокаТЧ.ВыходнаяФорма="СФ" или СтрокаТЧ.ВыходнаяФорма="КоррСФ"  или СтрокаТЧ.ВыходнаяФорма="УПД" Тогда
			Попытка
				ОбработкаПечати.Исправление = Исправление;
				ОбработкаПечати.КоррСФ = КоррСФ;
			Исключение
			КонецПопытки;
		КонецЕсли;
		
		////нечаева 27.08.15+++ неучит рекламацу  --- заменила на доп параметры.
		//Если  СтрокаТЧ.ВыходнаяФорма<>"Спец." Тогда
		//	ОбработкаПечати.НеУчитыватьРекламации = НеУчитыватьРекламации;
		//КонецЕсли;
		////нечаева 27.08.15-- неучит рекламацу
		
		//нечаева  04,09,15+++      
		ДопПараметы.Вставить("НеУчитыватьРекламации",НеУчитыватьРекламации);
		//нечаева  04,09,15---
		
		
		//Катаев- 31/03/14
		ОбработкаПечати.Дата=?(ЕстьРеквизитДокумента("ДатаОтгрузки",ТекДок.Метаданные()),ТекДок.ДатаОтгрузки,ТекДок.Дата);
		
		ТабДок					= ОбработкаПечати.Печать(ТекДок.ПолучитьОбъект(),ДопПараметы);
		//крохин начало 28.07.2017
		//новая галка в наборе печатных форм
		Если СтрокаТЧ.НеПечатать Тогда Продолжить КонецЕсли;
		//крохин конец 28.07.2017
		
		Если ТабДок=Неопределено Тогда Продолжить КонецЕсли; 
		
		Если НЕ ПустаяСтрока(ИмяПринтера) Тогда
			ТабДок.ИмяПринтера	= ИмяПринтера;		
		КонецЕсли;		
		
		Если Сохранять Тогда
			Если ПустаяСтрока(КаталогСохраненияВыходныхФорм) Тогда
				Предупреждение("Не указан каталог сохранения выходных форм !!!");
			Иначе
				ТабДокСохранения = Новый ТабличныйДокумент;
				ТабДокСохранения.ОриентацияСтраницы=ОриентацияСтраницы.Ландшафт;
				
				ТабДокСохранения.ПолеСверху	= ТабДок.ПолеСверху;
				ТабДокСохранения.ПолеСнизу	= ТабДок.ПолеСнизу;
				ТабДокСохранения.ПолеСлева	= ТабДок.ПолеСлева;
				ТабДокСохранения.ПолеСправа	= ТабДок.ПолеСправа;
				
				ТабДокСохранения.АвтоМасштаб					=ТабДок.АвтоМасштаб;
				
				ТабДокСохранения.ОтображатьСетку				=ТабДок.ОтображатьСетку;
				ТабДокСохранения.ОтображатьЗаголовки			=ТабДок.ОтображатьЗаголовки;
				
				ТабДокСохранения.СохранятьСвойстваОтображения	=Истина;
				
				Для Сч=1 по КоличествоЭкземпляров Цикл
					ТабДокСохранения.Вывести(ТабДок);					
					Если Сч<>КоличествоЭкземпляров Тогда
						ТабДокСохранения.ВывестиГоризонтальныйРазделительСтраниц();					
					КонецЕсли;					
				КонецЦикла;		
				
				//ТабДокСохранения.Записать(СокрЛП(КаталогСохраненияВыходныхФорм)+""+ТекДок.Номер+"_"+СтрокаТЧ.ВыходнаяФорма+".xls",ТипФайлаТабличногоДокумента.XLS);
				ТабДокСохранения.Записать(СокрЛП(КаталогСохраненияВыходныхФорм)+""+ТекДок.Номер+"_"+СтрокаТЧ.ВыходнаяФорма+"."+ФорматСохранения,ТипФайлаТабличногоДокумента[ФорматСохранения]);
			КонецЕсли;  
		КонецЕсли;		
		
		Если СразуНаПринтер Тогда	
			ТабДок.КоличествоЭкземпляров	= КоличествоЭкземпляров;
			ТабДок.РазборПоКопиям		    = Истина;
			
			ТабДок.Напечатать();					
		КонецЕсли;	
		
		Если Просмотр Тогда
			ТабДок.Показать(""+СтрокаТЧ.ВыходнаяФорма+" "+ТекДок.Номер);
		КонецЕсли; 		
	КонецЦикла;
	
	ДокОбъект=ТекДок.ПолучитьОбъект();
	Если ЕстьРеквизитДокумента("СостояниеДокументов",ДокОбъект.Метаданные()) Тогда
		СостояниеДокументов=ДокОбъект.СостояниеДокументов;
		Если СостояниеДокументов=Перечисления.СостояниеДокументов.НеВыписаны ИЛИ СостояниеДокументов.Пустая() Тогда
		//	ДокОбъект.СостояниеДокументов=Перечисления.СостояниеДокументов.Выписаны;
		//	ДокОбъект.Записать(РежимЗаписиДокумента.Запись);
			ДокОбъект.УстановитьСостояниеДокументов(Перечисления.СостояниеДокументов.Выписаны);
		 ИначеЕсли СостояниеДокументов=Перечисления.СостояниеДокументов.ПолученыСИзменениями Тогда
						//ДокОбъект.СостояниеДокументов=Перечисления.СостояниеДокументов.ВыписаныПовторно;		
			//ДокОбъект.Записать(РежимЗаписиДокумента.Запись);
			//Катаев+ 23/10/13 По письму Кудряшова "При нажатии ПД первый раз (СФ не создана или удалена), состояние документов меняется на «выписаны». При повторных нажатиях ПД (СФ создана), состояние документов не меняется." 
			//ДокОбъект.УстановитьСостояниеДокументов(Перечисления.СостояниеДокументов.ВыписаныПовторно);
			//Катаев- 23/10/13
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры


//кухарь обработка масс печати номеров приёмки метро 12.09.13 начало

функция СоздатьPDF(Исправление = Ложь, КоррСФ = Ложь, НеУчитыватьРекламации=Ложь) Экспорт	
	ИмяПринтера=ПолучитьЗначениеПоУмолчанию("ОсновнойПринтер");	
	
	ДопПараметы=Новый Структура;
	ДопПараметы.Вставить("НаборПечатныхФорм",НаборФорм);
	ДопПараметы.Вставить("ПакетнаяПечать",Истина);
	//ТабДляPDF =новый ТабличныйДокумент;
	СписокТаб=новый Массив;
	
	//крохин начало 12.06.2019
	Если НЕ ТекДокРКМ.Пустая() Тогда
		
	ДопПараметы.Вставить("ТекДокРКМ",ТекДокРКМ);
КонецЕсли;
	//крохин конец 12.06.2019

	Для Каждого СтрокаТЧ Из НаборФорм.Список Цикл
		//крохин начало 01.03.2012
		//Для контрагентов ЕЕЭ без претензий печатаем документы исходя из способа доставки
		//КоличествоЭкземпляров=СтрокаТЧ.КоличествоЭкземпляров+КоличествоДопЭкземпляров;
		СтандартноеКоличествоЭкземпляровДляПечати = 0;

		//Кухарь 04.05.18 начало
		//Тип доставки теперь есть в документе
		//Если ТекДок.ПунктДоставки.ТипДоставки = Перечисления.ТипыДоставки.ТранспортнаяКомпания Тогда		
		попытка
			если ЗначениеЗаполнено(ТекДок.ТипДоставки) тогда
				ТипДоставки=ТекДок.ТипДоставки;
			иначе
				ТипДоставки=ТекДок.ПунктДоставки.ТипДоставки;
			КонецЕсли;
		Исключение
			ТипДоставки=ТекДок.ПунктДоставки.ТипДоставки;
		КонецПопытки;
		//Кухарь 04.05.18 конец			
		
		Если ТекДок.Метаданные().имя = "РасходнаяНакладная" И ТекДок.Контрагент.ТранспортныйОтдел = Справочники.Контрагенты.НайтиПоКоду("SSR-1610") Тогда
			//Кухарь 04.05.18 начало
			//Тип доставки теперь есть в документе
			//Если ТекДок.ПунктДоставки.ТипДоставки = Перечисления.ТипыДоставки.ТранспортнаяКомпания Тогда
			Если ТипДоставки = Перечисления.ТипыДоставки.ТранспортнаяКомпания Тогда
					//Кухарь 04.05.18 конец				
				Если СтрокаТЧ.ВыходнаяФорма="Торг12" Тогда
					СтандартноеКоличествоЭкземпляровДляПечати=3;			
				ИначеЕсли СтрокаТЧ.ВыходнаяФорма="СФ" Тогда		
					СтандартноеКоличествоЭкземпляровДляПечати=3;	
					//	ИначеЕсли СтрокаТЧ.ВыходнаяФорма="ТТН" тогда
					//		СтрокаТЧ.КоличествоЭкземпляров=3;
				ИначеЕсли СтрокаТЧ.ВыходнаяФорма="Спец." тогда
					Продолжить; 
				КонецЕсли;	
				//Кухарь 04.05.18 начало
				//Тип доставки теперь есть в документе
				//ИначеЕсли ТекДок.ПунктДоставки.ТипДоставки = Перечисления.ТипыДоставки.Доставка Тогда
			ИначеЕсли ТипДоставки = Перечисления.ТипыДоставки.Доставка Тогда
				//Кухарь 04.05.18 конец	
				Если СтрокаТЧ.ВыходнаяФорма="Торг12" Тогда
					СтандартноеКоличествоЭкземпляровДляПечати=2;			
				ИначеЕсли СтрокаТЧ.ВыходнаяФорма="СФ" Тогда		
					СтандартноеКоличествоЭкземпляровДляПечати=2;	
					//	ИначеЕсли СтрокаТЧ.ВыходнаяФорма="ТТН" тогда
					//		СтрокаТЧ.КоличествоЭкземпляров=3;
				ИначеЕсли СтрокаТЧ.ВыходнаяФорма="Спец." тогда
					Продолжить;; 
				КонецЕсли;	
				//Кухарь 04.05.18 начало
				//Тип доставки теперь есть в документе
				//ИначеЕсли ТекДок.ПунктДоставки.ТипДоставки = Перечисления.ТипыДоставки.Самовывоз Тогда
			ИначеЕсли ТипДоставки = Перечисления.ТипыДоставки.Самовывоз Тогда
				//Кухарь 04.05.18 конец	

				Если СтрокаТЧ.ВыходнаяФорма="Торг12" Тогда
					СтандартноеКоличествоЭкземпляровДляПечати=2;			
				ИначеЕсли СтрокаТЧ.ВыходнаяФорма="СФ" Тогда		
					СтандартноеКоличествоЭкземпляровДляПечати=2;	
					//	ИначеЕсли СтрокаТЧ.ВыходнаяФорма="ТТН" тогда
					//		СтрокаТЧ.КоличествоЭкземпляров=3;
				ИначеЕсли СтрокаТЧ.ВыходнаяФорма="Спец." тогда
					Продолжить; 
				КонецЕсли;	
				
			КонецЕсли;
			//+++Лобан 130912	
		ИначеЕсли ТекДок.Метаданные().имя = "Перемещение" тогда
			Если СтрокаТЧ.ВыходнаяФорма="Торг13" Тогда
				СтандартноеКоличествоЭкземпляровДляПечати=2
			КонецЕсли;
			//---Лобан 130912			
		КонецЕсли;
		//крохин конец 01.03.2012
		
		//крохин начало 17.05.2012
		Если СтрокаТЧ.НестандартноеКоличествоДокументов Тогда
			СтандартноеКоличествоЭкземпляровДляПечати = СтрокаТЧ.КоличествоЭкземпляров;	
		КонецЕсли;
		//крохин конец 17.05.2012
		
		Если СтандартноеКоличествоЭкземпляровДляПечати <> 0 Тогда
			КоличествоЭкземпляров = СтандартноеКоличествоЭкземпляровДляПечати+КоличествоДопЭкземпляров;
		Иначе
			КоличествоЭкземпляров=СтрокаТЧ.КоличествоЭкземпляров+КоличествоДопЭкземпляров;
		КонецЕсли;
		//крохин начало 05.06.2012
		//для документов без цен печатаем только ТОРГ-12
		//+++Лобан 130912	
		//Старый код
		//Если ТекДок.Товары.Итог("Всего") = 0 И СтрокаТЧ.ВыходнаяФорма <> "Торг12" Тогда
		//	КоличествоЭкземпляров = 0;
		//КонецЕсли;
		//Новый код
		Если ТекДок.Товары.Итог("Всего") = 0 И СтрокаТЧ.ВыходнаяФорма <> "Торг12" И СтрокаТЧ.ВыходнаяФорма <> "Торг13" Тогда
			КоличествоЭкземпляров = 0;
		КонецЕсли;
		//---Лобан 130912
		//крохин конец 05.06.2012
		
		Если КоличествоЭкземпляров=0 Тогда Продолжить КонецЕсли;
		
		
		УстановитьОрганизацию(СтрокаТЧ);
		
		ДопПараметы.Вставить("ВыходнаяФорма",СтрокаТЧ);
		
		ОбработкаПечатиОбъект	= ПолучитьВнешнююОбработку(СтрокаТЧ.ИмяФайла,"PrnForms\");		
		Если ОбработкаПечатиОбъект=Неопределено Тогда Возврат Неопределено КонецЕсли; 
		
		ОбработкаПечати=ОбработкаПечатиОбъект.ПолучитьФорму();
		ОбработкаПечати.Дата=?(ЕстьРеквизитДокумента("ДатаОтгрузки",ТекДок.Метаданные()),ТекДок.ДатаОтгрузки,ТекДок.Дата);
		//нечаева 30,06,15+++ для печати исходного докмуента
		//ОбработкаПечати.неучитыватьРекламации = неУчитыватьРекламации;
		//ОбработкаПечати.коррСФ = коррСФ;
		//ОбработкаПечати.Исправление = Исправление;
		//  //нечаева 30,06,15---
		//
		
		//нечаева 04,09,15+++
		ДопПараметы.Вставить("неучитыватьРекламации",неучитыватьРекламации);
		ДопПараметы.Вставить("коррСФ",коррСФ);
		ДопПараметы.Вставить("Исправление",Исправление);
		//нечаева 04,09,15---
	

		
		////Катаев+ 31/03/14
		//ОбработкаПечати.Исправление = Исправление;
		//ОбработкаПечати.КоррСФ = КоррСФ;
		////Катаев- 31/03/14
		
		ТабДок					= ОбработкаПечати.Печать(ТекДок.ПолучитьОбъект(),ДопПараметы);
		// нечаева 01,07,15+++
		Если ТабДок<>Неопределено  Тогда
			
			//СписокТаб.Добавить(ТабДок);
			
			//нечаева 14,06,17+++ добавляем все документы по КСФ, а не только последнюю.
			Если Тип(ТабДок) = Тип("Массив") Тогда
				
				Для Каждого Элемент Из ТабДок Цикл
					СписокТаб.Добавить(Элемент);
				КонецЦикла;
			иначе
				СписокТаб.Добавить(ТабДок);
			КонецЕсли;	
			//нечаева 14,06,17----
			

			
		КонецЕсли;
		// нечаева 01,07,15---
		
		Если ТабДок=Неопределено Тогда Продолжить КонецЕсли; 
		
		Если НЕ ПустаяСтрока(ИмяПринтера) Тогда
			ТабДок.ИмяПринтера	= ИмяПринтера;		
		КонецЕсли;
	 //табдок=Новый ТабличныйДокумент;
	 //табдок.АвтоМасштаб=Истина;
	 //табдок.ОриентацияСтраницы=ОриентацияСтраницы.Ландшафт;
		//табдок.показать();
		//ТабДляPDF.Вывести(ТабДок);
		//ТабДляPDF.ВывестиГоризонтальныйРазделительСтраниц();
		//ТабДляPDF.показать();

	КонецЦикла;
	
	 //	сч=0;
	 //	для каждого Стаб из СписокТаб цикл
	 //   	 стаб.показать();
	 //	если сч=0 тогда
	 //   	 ТабДляPDF=Стаб;
	 //	Иначе 
	 //   	 ТабДляPDF.ВывестиГоризонтальныйРазделительСтраниц();
	 //   	 ТабДляPDF.вывести(Стаб);
	 //   КонецЕсли;
	 //   сч=сч+1;	 
	 //КонецЦикла;
	 //ТабДляPDF.показать();


	возврат СписокТаб;	
КонецФункции

 //кухарь обработка масс печати номеров приёмки метро 12.09.13 конец
